---
kind: type
id: T:Autodesk.Revit.Exceptions.CorruptModelException
source: html/b1a877a7-6c68-c0e4-25c9-005ee153bc60.htm
---
# Autodesk.Revit.Exceptions.CorruptModelException

The exception that is thrown when the model is or seems corrupt.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class CorruptModelException : ApplicationException
```